Tekla Open API Reference for Tekla Structures 2025
HierarchicDefinition.Modify Method
 Modifies the hierarchical definition instance in the model. The ID must be set.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Modify()
Public Overrides Function Modify As Boolean
Return Value
Type: Boolean
True if the modification was successful.
See Also
Reference
HierarchicDefinition Class
Tekla.Structures.Model Namespace